# learning-cpp
**Hi, i make this rep because i want to learn a C++  and learn more** 

## What means les2 les3 ...?
* les2|les1.1 - Структура и порядок выполнения программы. + Namespace
* les3 - Escape - последовательности. Как использовать.
* les4 - Типы данных - теория + шпарагалка (https://github.com/BogdanKolesnikow/learning-cpp/blob/main/les4/%D1%82%D0%B8%D0%BF%D1%8B%D0%B4%D0%B0%D0%BD%D0%BD%D1%8B%D1%85-%D1%88%D0%BF%D0%B0%D1%80%D0%B3%D0%B0%D0%BB%D0%BA%D0%B0%D0%A1%2B%2B.png)
* les5 - переменные. Способы объявления. Правила именования.
* les6 - Константы. Ключевое слово const.
* les7 - Ввод данных. Cin. Пример. Синтаксис.
* les8 - Операторы. Арифметические операции с числами.
* les8_HM - домашнее задание "Введите три числа и выведите на экран значение суммы, произведения и среднее арифметическое этих чисел."
* les9 - Инкремент и декремент. Постфиксный и префиксный. Пример. Синтаксис.
* les10 - Сокращенные арифметические формы +=, -= и т д.
* les11 - Логические операции. Операторы сравнения, равенства, объединения, инверсия.
* les12 - If else. Конструкция логического выбора if. Лесенка if - else if. Примеры использования.
* les12_HM - Напишите программу, проверяющую число, введенное с клавиатуры на четность.
* les13 - Switch. Что это. Пример. Синтаксис. Оператор множественного выбора.
* les13_HM - Написать простой калькулятор. Пользователь вводит значение двух переменных. Описать меню в консоли для математических операций сложения, вычитания, умножения, деления. Через оператор switch реализовать математическую операцию соответствующую пункту меню.
* les14 - Циклы. Цикл while. Что это. Что делает. Пример. Синтаксис.
* les15 - Циклы. Цикл do while. Что это. Что делает. Пример. Синтаксис.
* les15_HM2 - 1ая утерена а готовый я не собераюсь вставлять) Написать программу, которая находит сумму всех целых нечетных чисел в диапазоне, указанном пользователе.
* les16 - Цикл for. Что это. Что делает. Пример. Синтаксис. Циклы.
* les17 - Цикл for. Фишки. Фичи. Особенности. Несколько переменных.
* les18 - Ключевое слово break. Оператор break. Описание. Пример. Синтаксис
* les19 - Ключевое слово continue c++ что это. Оператор continue. Пример. Синтаксис.
* les20 - теория как открыть .exe (bored)
* les21 - Задержка экрана консоли. теория (спойлер -->>)```system("pause");```
* les22 - Оператор перехода goto. Когда код становится непонятен даже создателю. - не советую использовать
* les23 - теория по отладке - (base)
* les24 - Что такое вложенный цикл. Вложенная конструкция. C++ для начинающих.
* les24_HM - Написать программу, которая выводит на экран прямоугольник символом *. Высота и ширина задаётся пользователем.
* les25 - Что такое массив. Примеры. Теория. Array. Одномерный массив. Синтаксис (https://learn.microsoft.com/ru-ru/cpp/cpp/arrays-cpp?view=msvc-170)
* les26- Инициализация массива. Способы. Инициализация массива нулями.
* les27 - Вывод массива. Массивы и циклы. Цикл с массивом. Array c++.
* les28 -
* les29 -


## Templates | Шаблоны

## 1. 
```
#include <iostream>
using namespace std;

int main()
{
	setlocale(LC_ALL, "ru");
}

/*
cout << "\n";
*/
```
